Note/FromRecursionToGreedy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-26 周日 19:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>From Recursion to Greedy algorithms: a functional perspective</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
</head>
<body>
<div id="content">
<h1 class="title">From Recursion to Greedy algorithms: a functional perspective</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9f2832f">1. Functional Programming とは &#x2026;</a></li>
<li><a href="#org35036b6">2. Divide and Conquer</a>
<ul>
<li><a href="#org7f1b059">2.1. Data structures by Lists</a>
<ul>
<li><a href="#org713c559">2.1.1. Replacing</a></li>
<li><a href="#org8107873">2.1.2. <b>Reversing lists</b></a></li>
<li><a href="#org58c0866">2.1.3. foldl or foldr?</a></li>
</ul>
</li>
<li><a href="#org80bf422">2.2. Expressions</a></li>
<li><a href="#org4c21372">2.3. Data structures by Trees</a>
<ul>
<li><a href="#org4ec97a5">2.3.1. Binary Tree</a></li>
<li><a href="#orgf468b01">2.3.2. More general trees</a></li>
</ul>
</li>
<li><a href="#org9816ddc">2.4. The answers</a>
<ul>
<li><a href="#org18dbb0b">2.4.1. What is data structure?</a></li>
<li><a href="#orga4135b8">2.4.2. What is algorithm?</a></li>
<li><a href="#orgce9e5ac">2.4.3. Links between data structures and algorithms?</a></li>
<li><a href="#orgeb28591">2.4.4. How to select?</a></li>
</ul>
</li>
<li><a href="#org3fb1ffe">2.5. Abstract Data Types <code>[4/7]</code></a>
<ul>
<li><a href="#orgee149a8">2.5.1. <span class="done DONE">DONE</span> Stack</a></li>
<li><a href="#org6323f0b">2.5.2. <span class="done DONE">DONE</span> Queue</a></li>
<li><a href="#orgc173af8">2.5.3. <span class="todo TODO">TODO</span> Heap</a></li>
<li><a href="#orgc47e7a4">2.5.4. <span class="todo NEXT">NEXT</span> Set</a></li>
<li><a href="#org9c5029f">2.5.5. <span class="done CANCELLED">CANCELLED</span> Vector</a></li>
<li><a href="#org53a7351">2.5.6. <span class="done CANCELLED">CANCELLED</span> Table</a></li>
<li><a href="#org947ea09">2.5.7. <span class="todo NEXT">NEXT</span> More Trees <code>[1/3]</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org50c75b9">3. Dynamic Programming</a>
<ul>
<li><a href="#orgbe17b49">3.1. A dynamic programming example by expanding data structure</a></li>
<li><a href="#org39fd440">3.2. A dynamic programming example by using extra data structure</a></li>
</ul>
</li>
<li><a href="#orgfa5a815">4. Greedy</a></li>
</ul>
</div>
</div>
<p>
There's an important leanring and developing chain of traditional algorithms:
</p>

<p>
<code>Divide and Conquer(recursion) ---&gt; Dynamic Programming(mermorization) --&gt; Greedy</code> 
</p>


<p>
This chain(route) is also quite suitble to get to think and solve a problem.
We may think problems in this way, but I sometimes just get confused if I insist on
following the rule. To collect our thinkings, programming languages play an really important role
in problem solving. Functional programming languages often work better for thinking but sometimes hard
to implement as efficiently as others. In fact, functional programming languages can also be very efficient
with careful implementation. As a programmer, we should get used to think in a more functional way and also,
be good at translate functional programs into other languages.
</p>


<div id="outline-container-org9f2832f" class="outline-2">
<h2 id="org9f2832f"><span class="section-number-2">1</span> Functional Programming とは &#x2026;</h2>
<div class="outline-text-2" id="text-1">
<p>
A functional programming language should have the following features:
</p>

<ol class="org-ol">
<li>Functions are first-class and thus can be passed as high-order function values.</li>
<li>Functions can be constructed without any side-effect.</li>
<li>Have both evaluation strategies: eager and lazy.</li>
</ol>


<p>
A functional programming language may have the following features:
</p>

<ol class="org-ol">
<li>Static and strict type system</li>
<li>Type polymorphism(type as type parameters)</li>
<li>Typeclass or trait(OO) system(u can also regard as structured overloading)</li>
<li>Pure without any side-effect(which means u can not survivie without monad:)</li>
<li>Dependent Typed System</li>
</ol>
</div>
</div>

<div id="outline-container-org35036b6" class="outline-2">
<h2 id="org35036b6"><span class="section-number-2">2</span> Divide and Conquer</h2>
<div class="outline-text-2" id="text-2">
<p>
Before starting to explore recursions, let us first reflect some questions:
</p>

<ol class="org-ol">
<li>What is data structure and what is a algorithm?</li>
<li>Any links between data structure and algorithms?</li>
<li>What kind of algorithm should we use for different kinds of data structures?</li>
</ol>
</div>

<div id="outline-container-org7f1b059" class="outline-3">
<h3 id="org7f1b059"><span class="section-number-3">2.1</span> Data structures by Lists</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In functional world, a very common and heavy used data structure is <b>List a(or [a] in haskell)</b>.
Let's look at its definition first:
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">data</span> <span style="color: #8ae234; font-weight: bold;">List</span> a <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Nil</span> <span style="color: #ff6347; font-weight: bold;">|</span> <span style="color: #8ae234; font-weight: bold;">Cons</span> a <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">List</span> a<span style="color: #ffd700;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org713c559" class="outline-4">
<h4 id="org713c559"><span class="section-number-4">2.1.1</span> Replacing</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
If we regard that <code>List</code> is just a function which receive a type and output a type, then we can rewrite
the definition(this is not strict&#x2026;):
</p>
<pre class="example">
List :: (a :: Type) -&gt; Type where
  Cons :: a -&gt; List a -&gt; List a
  Nil  :: List a
</pre>
<p>
We just defined 3 functions, this can be easily done with dependent typed languages.
For a simple list: <code>[1, 2, 3],</code> we can simply write it done:
</p>
<pre class="example">
(Cons 1 (Cons 2 (Cons 3 Nil)))
</pre>
<p>
Now we just replace all <code>Cons</code> into <code>(+)</code> and <code>Nil</code> into <code>0</code>.
</p>
<pre class="example">
((+) 1 ((+) 2 ((+) 3 0))) =&gt; 1 + 2 + 3 + 0 =&gt; 6
</pre>
<p>
We just turned a unfoldable(terminated form) into a foldable expression!
You may see that List is a prototype of many expressions, we can use this abstracted data structure
to generate more expressions without actually writing them character after charater!
</p>

<p>
Now define a replacing function:
</p>
<pre class="example">
replace f a (Cons x xs) = f x (replace f a xs)
replace f a Nil = a
</pre>
<p>
In fact, this function is called <code>foldr</code> in Haskell.
By using <span class="underline">Lists</span>, we can divide and store problems into many linear sub-problems, i.e.
To solve a problem, we only need to solve one sub-problem before.(this give us hint to convert this recursion to loops)
</p>
</div>
</div>

<div id="outline-container-org8107873" class="outline-4">
<h4 id="org8107873"><span class="section-number-4">2.1.2</span> <b>Reversing lists</b></h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
One more interesting thing is that Haskell also have the function <code>foldl.</code> 
Then what's the differences between <code>foldr</code> and <code>foldl</code> ?
</p>

<p>
Lets again use our addition example.
</p>
<pre class="example">
xs = [0, 1, 2, 3] 
foldr (+) 0 xs =&gt; ((+) 0 ((+) 1 ((+) 2 ((+) 3 0)))) =&gt; (0 + 1 + 2 + 3 + 0)
foldl (+) 0 xs =&gt; ((+) ((+) ((+) ((+) 0 0) 1) 2) 3) =&gt; (0 + 0 + 1 + 2 + 3)
</pre>

<p>
Compared with <code>foldr</code>, <code>foldl</code> is can be seen as a reversed list-constructed expression.
Let's try to implement our <code>foldl</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">foldl</span> f z <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #ff6347; font-weight: bold;">=</span> z
<span style="color: #edd400; font-weight: bold;">foldl</span> f z <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> foldl f <span style="color: #ffd700;">(</span>f z x<span style="color: #ffd700;">)</span> xs
</pre>
</div>

<p>
Great! Try to reverse a list using foldl:
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">reverse</span> <span style="color: #ff6347; font-weight: bold;">=</span> foldl <span style="color: #ffd700;">(</span>flip <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">:</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org58c0866" class="outline-4">
<h4 id="org58c0866"><span class="section-number-4">2.1.3</span> foldl or foldr?</h4>
<div class="outline-text-4" id="text-2-1-3">
<ol class="org-ol">
<li>If we are in a stack model, then foldl can be used without worrying about stackoverflow.</li>
<li>Both are valid if we have the rule: (f a (f b c)) = (f (f a b) c). In other words, the type a in <code>List a</code> should
be an instance of typeclass <span class="underline">Monoid</span>.</li>
</ol>
</div>
</div>
</div>
