Note/FromRecursionToGreedy.org
*** Expressions
In the last part, we talked about data structures. However, a new question raised that,
What exactly is an expression??

Let's first get a simple definition.
#+BEGIN_SRC 
An expression is any valid unit of code that resolves to a value.
#+END_SRC
Well, this looks still not enough straight-forward answer.
If so, then what is value??

Before we have the ability and knowledge to answer these questions, let's firstly introduce some
necessary terminologies.

- *Thunk*
#+BEGIN_SRC 
A thunk is another name for the function(but the special one).
It's a function yet to be evaluated.
For example, in Haskell, every expression is lazy and be stored into a thunk.
#+END_SRC

- *Beta reduction*
#+BEGIN_SRC 
Beta reduction is a process of calculating result of a function after function application.
We can now simple regard this process as a special replacing of introduced local variables.
#+END_SRC

Ok! Now let's explore it! What is a value?
Firstly I guess /value/ is the form that can not be calculated further.
If I'm right... what about ...

*Definition of Redeuced Normal Form(RNF)* 
#+BEGIN_SRC 
Expression A has RNF if there exists term B obtained from A that is in RNF and B is in RNF where 
there’s no term A such A can be obtained from B and A has RNF.
#+END_SRC
To make my life easier, RNF is the form whose sub-expressions(including itself) can not be reduced any further.

*(Head) Normal Form*
#+BEGIN_SRC 
An expression in (Head)normal form is fully evaluated, and no sub-expression could be evaluated any further.
#+END_SRC
Well, seems similar to RNF. Next form is quite important:

*Weak Head Normal Form(WHNF)*
#+BEGIN_SRC 
An expression is in weak head normal form when the outermost part has been evaluated to 
the data constructor or lambda abstraction. Sub-expressions may not have been evaluated. 
If all the sub-expressions would be evaluated then the expression would be in normal form. 
The conclusion is: every normal form expression is also in weak normal form. The opposite is not always the true.
#+END_SRC
for example:
#+BEGIN_SRC 
(1 + 1, 1 + 2)      
'h' : ("e" ++ "llo")
\x -> 2 + 2 
#+END_SRC

Alright, we've got the point of Haskell's lazy evlauation strategy.
In Haskell, expressions are evaluated until they are in need.
To be more precise, "in need" means we need to do pattern matching by data constructors.

Now I suppose I was wrong. Value should not be just expressions can not be evaluated further.
In lazy languages, it can also means _weak head normal form_.

Finally we feel that we've got better understanding of expressions...(although still confusing and error-prone)

*** Data structures by Trees
Unlike /Lists,/ Trees allow us to divide problems into many sub-problems.
To make things simple and clear, we first focus on _binary trees_.

**** Binary Tree
#+BEGIN_SRC haskell

data BinTree a = Empty | Node a (BinTree a) (BinTree a)
#+END_SRC
Again this data strucutre is a prototype for recursion algorithms.
Now we create an example and try to do the same things as /Lists/.

- An example of Binary Tree
#+BEGIN_SRC 
tree :: BinTree Int
tree = Node 0
         (Node 1 Empty Empty)
         (Node 2 
           (Node 3 Empty
                  (Node 4 Empty Empty))
           (Node 5 
             (Node 6 Empty Empty)
             (Node 7 Empty Empty)))
#+END_SRC
  + Visualization
#+BEGIN_SRC 
           0
    1             2
             3         5
               4     6   7
#+END_SRC

- Replacing(folding)
We want to do the replacing thing as Lists do.
Observe that this time we may have more parameters to replace:
  1. Node
  2. Empty
  3. ??
If the function to replace =Node= is binary(a -> b -> b), then we need the third pararmeter to combine
sub-trees.
Else, the third para is not necessary.

- A naive replacing
#+BEGIN_SRC haskell

replace f z Empty = z
replace f z (Node v t0 t1) = f v (replace f z t0) (replace f z t1)
#+END_SRC
  + Visualization of the example
#+BEGIN_SRC 
f 0 (f 1 z z)
    (f 2 (f 3 z 
              (f 4 z z))
         (f 5 (f 6 z z)
              (f 7 z z)))
#+END_SRC

Now we can add all numbers of =BinTree Int=.
#+BEGIN_SRC haskell

sum = replace (\v a b -> v + a + b) 0
#+END_SRC

***** Using tricks as foldl in Lists
If we want to traverse a binary tree in an inorder order:

- Naive inorder traverse
#+BEGIN_SRC haskell

inorder Empty = []
inorder (Node v t0 t1) = inorder t0 ++ [v] ++ inorder t1
#+END_SRC
This is valid but not efficient for too many append operations.
Let's try to do some expression transformations:
#+BEGIN_SRC haskell

inorder' t@(Node v t0 t1) a = inorder t ++ a
  = inorder t0 ++ [v] ++ inorder t1 ++ a
  = inorder to ++ (v:(inorder' t1 a))
  = inorder' t0 (v:(inorder' t1 a)) 
#+END_SRC
Finally we have:
#+BEGIN_SRC haskell

inorder' t = inorder'' t [] where
  inorder'' Empty z = z
  inorder'' (Node v t0 t1) z = inorder'' t0 (v:(inorder'' t1 a)) 
#+END_SRC

