Note/FromRecursionToGreedy.html

<div id="outline-container-org80bf422" class="outline-3">
<h3 id="org80bf422"><span class="section-number-3">2.2</span> Expressions</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In the last part, we talked about data structures. However, a new question raised that,
What exactly is an expression??
</p>

<p>
Let's first get a simple definition.
</p>
<pre class="example">
An expression is any valid unit of code that resolves to a value.
</pre>
<p>
Well, this looks still not enough straight-forward answer.
If so, then what is value??
</p>

<p>
Before we have the ability and knowledge to answer these questions, let's firstly introduce some
necessary terminologies.
</p>

<ul class="org-ul">
<li><b>Thunk</b></li>
</ul>
<pre class="example">
A thunk is another name for the function(but the special one).
It's a function yet to be evaluated.
For example, in Haskell, every expression is lazy and be stored into a thunk.
</pre>

<ul class="org-ul">
<li><b>Beta reduction</b></li>
</ul>
<pre class="example">
Beta reduction is a process of calculating result of a function after function application.
We can now simple regard this process as a special replacing of introduced local variables.
</pre>

<p>
Ok! Now let's explore it! What is a value?
Firstly I guess <i>value</i> is the form that can not be calculated further.
If I'm right&#x2026; what about &#x2026;
</p>

<p>
<b>Definition of Redeuced Normal Form(RNF)</b> 
</p>
<pre class="example">
Expression A has RNF if there exists term B obtained from A that is in RNF and B is in RNF where 
there’s no term A such A can be obtained from B and A has RNF.
</pre>
<p>
To make my life easier, RNF is the form whose sub-expressions(including itself) can not be reduced any further.
</p>

<p>
<b>(Head) Normal Form</b>
</p>
<pre class="example">
An expression in (Head)normal form is fully evaluated, and no sub-expression could be evaluated any further.
</pre>
<p>
Well, seems similar to RNF. Next form is quite important:
</p>

<p>
<b>Weak Head Normal Form(WHNF)</b>
</p>
<pre class="example">
An expression is in weak head normal form when the outermost part has been evaluated to 
the data constructor or lambda abstraction. Sub-expressions may not have been evaluated. 
If all the sub-expressions would be evaluated then the expression would be in normal form. 
The conclusion is: every normal form expression is also in weak normal form. The opposite is not always the true.
</pre>
<p>
for example:
</p>
<pre class="example">
(1 + 1, 1 + 2)      
'h' : ("e" ++ "llo")
\x -&gt; 2 + 2 
</pre>

<p>
Alright, we've got the point of Haskell's lazy evlauation strategy.
In Haskell, expressions are evaluated until they are in need.
To be more precise, "in need" means we need to do pattern matching by data constructors.
</p>

<p>
Now I suppose I was wrong. Value should not be just expressions can not be evaluated further.
In lazy languages, it can also means <span class="underline">weak head normal form</span>.
</p>

<p>
Finally we feel that we've got better understanding of expressions&#x2026;(although still confusing and error-prone)
</p>
</div>
</div>

<div id="outline-container-org4c21372" class="outline-3">
<h3 id="org4c21372"><span class="section-number-3">2.3</span> Data structures by Trees</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Unlike <i>Lists,</i> Trees allow us to divide problems into many sub-problems.
To make things simple and clear, we first focus on <span class="underline">binary trees</span>.
</p>
</div>

<div id="outline-container-org4ec97a5" class="outline-4">
<h4 id="org4ec97a5"><span class="section-number-4">2.3.1</span> Binary Tree</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">data</span> <span style="color: #8ae234; font-weight: bold;">BinTree</span> a <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Empty</span> <span style="color: #ff6347; font-weight: bold;">|</span> <span style="color: #8ae234; font-weight: bold;">Node</span> a <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">BinTree</span> a<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">BinTree</span> a<span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
Again this data strucutre is a prototype for recursion algorithms.
Now we create an example and try to do the same things as <i>Lists</i>.
</p>

<ul class="org-ul">
<li>An example of Binary Tree</li>
</ul>
<pre class="example">
tree :: BinTree Int
tree = Node 0
         (Node 1 Empty Empty)
         (Node 2 
           (Node 3 Empty
                  (Node 4 Empty Empty))
           (Node 5 
             (Node 6 Empty Empty)
             (Node 7 Empty Empty)))
</pre>
<ul class="org-ul">
<li>Visualization</li>
</ul>
<pre class="example">
           0
    1             2
             3         5
               4     6   7
</pre>

<ul class="org-ul">
<li>Replacing(folding)</li>
</ul>
<p>
We want to do the replacing thing as Lists do.
Observe that this time we may have more parameters to replace:
</p>
<ol class="org-ol">
<li>Node</li>
<li>Empty</li>
<li>??</li>
</ol>
<p>
If the function to replace <code>Node</code> is binary(a -&gt; b -&gt; b), then we need the third pararmeter to combine
sub-trees.
Else, the third para is not necessary.
</p>

<ul class="org-ul">
<li>A naive replacing</li>
</ul>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">replace</span> f z <span style="color: #8ae234; font-weight: bold;">Empty</span> <span style="color: #ff6347; font-weight: bold;">=</span> z
<span style="color: #edd400; font-weight: bold;">replace</span> f z <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v t0 t1<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> f v <span style="color: #ffd700;">(</span>replace f z t0<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>replace f z t1<span style="color: #ffd700;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>Visualization of the example</li>
</ul>
<pre class="example">
f 0 (f 1 z z)
    (f 2 (f 3 z 
              (f 4 z z))
         (f 5 (f 6 z z)
              (f 7 z z)))
</pre>

<p>
Now we can add all numbers of <code>BinTree Int</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">sum</span> <span style="color: #ff6347; font-weight: bold;">=</span> replace <span style="color: #ffd700;">(</span><span style="color: #ff6347; font-weight: bold;">\</span>v a b <span style="color: #ff6347; font-weight: bold;">-&gt;</span> v <span style="color: #ff6347; font-weight: bold;">+</span> a <span style="color: #ff6347; font-weight: bold;">+</span> b<span style="color: #ffd700;">)</span> 0
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orge4bf8ad"></a>Using tricks as foldl in Lists<br />
<div class="outline-text-5" id="text-2-3-1-1">
<p>
If we want to traverse a binary tree in an inorder order:
</p>

<ul class="org-ul">
<li>Naive inorder traverse</li>
</ul>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">inorder</span> <span style="color: #8ae234; font-weight: bold;">Empty</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
<span style="color: #edd400; font-weight: bold;">inorder</span> <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v t0 t1<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> inorder t0 <span style="color: #ff6347; font-weight: bold;">++</span> <span style="color: #ffd700;">[</span>v<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">++</span> inorder t1
</pre>
</div>
<p>
This is valid but not efficient for too many append operations.
Let's try to do some expression transformations:
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">inorder'</span> t<span style="color: #ff6347; font-weight: bold;">@</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v t0 t1<span style="color: #ffd700;">)</span> a <span style="color: #ff6347; font-weight: bold;">=</span> inorder t <span style="color: #ff6347; font-weight: bold;">++</span> a
  <span style="color: #ff6347; font-weight: bold;">=</span> inorder t0 <span style="color: #ff6347; font-weight: bold;">++</span> <span style="color: #ffd700;">[</span>v<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">++</span> inorder t1 <span style="color: #ff6347; font-weight: bold;">++</span> a
  <span style="color: #ff6347; font-weight: bold;">=</span> inorder to <span style="color: #ff6347; font-weight: bold;">++</span> <span style="color: #ffd700;">(</span>v<span style="color: #8ae234; font-weight: bold;">:</span><span style="color: #00bfff;">(</span>inorder' t1 a<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">=</span> inorder' t0 <span style="color: #ffd700;">(</span>v<span style="color: #8ae234; font-weight: bold;">:</span><span style="color: #00bfff;">(</span>inorder' t1 a<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> 
</pre>
</div>
<p>
Finally we have:
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">inorder'</span> t <span style="color: #ff6347; font-weight: bold;">=</span> inorder'' t <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #729fcf; font-weight: bold;">where</span>
  inorder'' <span style="color: #8ae234; font-weight: bold;">Empty</span> z <span style="color: #ff6347; font-weight: bold;">=</span> z
  inorder'' <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v t0 t1<span style="color: #ffd700;">)</span> z <span style="color: #ff6347; font-weight: bold;">=</span> inorder'' t0 <span style="color: #ffd700;">(</span>v<span style="color: #8ae234; font-weight: bold;">:</span><span style="color: #00bfff;">(</span>inorder'' t1 a<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> 
</pre>
</div>
</div>
</li>
</ol>
</div>
