Note/FromRecursionToGreedy.org
**** More general trees
#+BEGIN_SRC haskell

data Tree a = Node a [Tree a]
#+END_SRC
Now we have the prototype to handle all recursion problems!

- Folding
#+BEGIN_SRC haskell

fold f z (Node v []) = f v [z]
fold f z (Node v ts) = f v $ map (fold f z) ts
#+END_SRC
or
#+BEGIN_SRC haskell

fold' f g z (Node v []) = f v z
fold' f g z (Node v ts) = f v $ (g $ map (fold' f g z) ts)
#+END_SRC

*** The answers
OK! now I may answer the three questions before(may be wrong, only my views):

**** What is data structure?
Data structures are recursion proto structures which can be used to solve problems.

**** What is algorithm?
Algorithms are _foldable_ data structures.

**** Links between data structures and algorithms?
Data structures can be easily converted to algorithms.
Algorithms can be used to generate data structures.

**** How to select?
To select data structures with respect to different kind os algorithms,
We should choose data structures which have the same recursion structure as the algorithm
as far as possible.

*** Abstract Data Types [4/7]
In fact, data structures we talked before are _Algebra Data Structures(ADT)_.
However, we can generize our types a little bit, we can define types by actions.

**** DONE Stack
The =Stack= implementation is quite straight-forward.
#+BEGIN_SRC haskell

class Stack s where
  push       :: a -> s a -> s a
  pop        :: s a -> s a
  top        :: s a -> a
  emptyStack :: s a

newtype Stk a = Stk [a]

instance Stack Stk where
  push x (Stk xs) = Stk (x:xs)

  pop (Stk [])     = error "Empty stack!"
  pop (Stk (_:xs)) = Stk xs

  top (Stk [])    = error "Empty stack!"
  top (Stk (x:_)) = x

  emptyStack = Stk []
#+END_SRC
Each step is in =O(1)= steps.

**** DONE Queue
#+BEGIN_SRC haskell

class Queue q where
  enqueue    :: a -> q a -> q a
  dequeue    :: q a -> q a
  front      :: q a -> a
  emptyQueue :: q a
#+END_SRC
***** A naive implementation
#+BEGIN_SRC haskell

newtype Que a = Q [a]

instance Queue Que where
  enqueue x (Q q) = Q (q ++ [x])

  dequeue (Q [])     = error "Empty queue!"
  dequeue (Q (_:xs)) = Q xs

  front (Q [])    = error "Empty queue!"
  front (Q (x:_)) = x

  emptyQueue = Q []
#+END_SRC
=enqueue= takes =O(n)= steps.

