Note/FromRecursionToGreedy.html

<div id="outline-container-orgf468b01" class="outline-4">
<h4 id="orgf468b01"><span class="section-number-4">2.3.2</span> More general trees</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">data</span> <span style="color: #8ae234; font-weight: bold;">Tree</span> a <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> a <span style="color: #ffd700;">[</span><span style="color: #8ae234; font-weight: bold;">Tree</span> a<span style="color: #ffd700;">]</span>
</pre>
</div>
<p>
Now we have the prototype to handle all recursion problems!
</p>

<ul class="org-ul">
<li>Folding</li>
</ul>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">fold</span> f z <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> f v <span style="color: #ffd700;">[</span>z<span style="color: #ffd700;">]</span>
<span style="color: #edd400; font-weight: bold;">fold</span> f z <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v ts<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> f v <span style="color: #ff6347; font-weight: bold;">$</span> map <span style="color: #ffd700;">(</span>fold f z<span style="color: #ffd700;">)</span> ts
</pre>
</div>
<p>
or
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">fold'</span> f g z <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> f v z
<span style="color: #edd400; font-weight: bold;">fold'</span> f g z <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v ts<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> f v <span style="color: #ff6347; font-weight: bold;">$</span> <span style="color: #ffd700;">(</span>g <span style="color: #ff6347; font-weight: bold;">$</span> map <span style="color: #00bfff;">(</span>fold' f g z<span style="color: #00bfff;">)</span> ts<span style="color: #ffd700;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9816ddc" class="outline-3">
<h3 id="org9816ddc"><span class="section-number-3">2.4</span> The answers</h3>
<div class="outline-text-3" id="text-2-4">
<p>
OK! now I may answer the three questions before(may be wrong, only my views):
</p>
</div>

<div id="outline-container-org18dbb0b" class="outline-4">
<h4 id="org18dbb0b"><span class="section-number-4">2.4.1</span> What is data structure?</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Data structures are recursion proto structures which can be used to solve problems.
</p>
</div>
</div>

<div id="outline-container-orga4135b8" class="outline-4">
<h4 id="orga4135b8"><span class="section-number-4">2.4.2</span> What is algorithm?</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Algorithms are <span class="underline">foldable</span> data structures.
</p>
</div>
</div>

<div id="outline-container-orgce9e5ac" class="outline-4">
<h4 id="orgce9e5ac"><span class="section-number-4">2.4.3</span> Links between data structures and algorithms?</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Data structures can be easily converted to algorithms.
Algorithms can be used to generate data structures.
</p>
</div>
</div>

<div id="outline-container-orgeb28591" class="outline-4">
<h4 id="orgeb28591"><span class="section-number-4">2.4.4</span> How to select?</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
To select data structures with respect to different kind os algorithms,
We should choose data structures which have the same recursion structure as the algorithm
as far as possible.
</p>
</div>
</div>
</div>

<div id="outline-container-org3fb1ffe" class="outline-3">
<h3 id="org3fb1ffe"><span class="section-number-3">2.5</span> Abstract Data Types <code>[4/7]</code></h3>
<div class="outline-text-3" id="text-2-5">
<p>
In fact, data structures we talked before are <span class="underline">Algebra Data Structures(ADT)</span>.
However, we can generize our types a little bit, we can define types by actions.
</p>
</div>

<div id="outline-container-orgee149a8" class="outline-4">
<h4 id="orgee149a8"><span class="section-number-4">2.5.1</span> <span class="done DONE">DONE</span> Stack</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
The <code>Stack</code> implementation is quite straight-forward.
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">class</span> <span style="color: #8ae234; font-weight: bold;">Stack</span> s <span style="color: #729fcf; font-weight: bold;">where</span>
  push       <span style="color: #ff6347; font-weight: bold;">::</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> s a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> s a
  pop        <span style="color: #ff6347; font-weight: bold;">::</span> s a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> s a
  top        <span style="color: #ff6347; font-weight: bold;">::</span> s a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> a
  emptyStack <span style="color: #ff6347; font-weight: bold;">::</span> s a

<span style="color: #729fcf; font-weight: bold;">newtype</span> <span style="color: #8ae234; font-weight: bold;">Stk</span> a <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Stk</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>

<span style="color: #729fcf; font-weight: bold;">instance</span> <span style="color: #8ae234; font-weight: bold;">Stack</span> <span style="color: #8ae234; font-weight: bold;">Stk</span> <span style="color: #729fcf; font-weight: bold;">where</span>
  push x <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Stk</span> xs<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Stk</span> <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span>

  pop <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Stk</span> <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>     <span style="color: #ff6347; font-weight: bold;">=</span> error <span style="color: #ad7fa8; font-style: italic;">"Empty stack!"</span>
  pop <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Stk</span> <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">_</span><span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Stk</span> xs

  top <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Stk</span> <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>    <span style="color: #ff6347; font-weight: bold;">=</span> error <span style="color: #ad7fa8; font-style: italic;">"Empty stack!"</span>
  top <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Stk</span> <span style="color: #00bfff;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span><span style="color: #729fcf; font-weight: bold;">_</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> x

  emptyStack <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Stk</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
</pre>
</div>
<p>
Each step is in <code>O(1)</code> steps.
</p>
</div>
</div>

<div id="outline-container-org6323f0b" class="outline-4">
<h4 id="org6323f0b"><span class="section-number-4">2.5.2</span> <span class="done DONE">DONE</span> Queue</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">class</span> <span style="color: #8ae234; font-weight: bold;">Queue</span> q <span style="color: #729fcf; font-weight: bold;">where</span>
  enqueue    <span style="color: #ff6347; font-weight: bold;">::</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> q a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> q a
  dequeue    <span style="color: #ff6347; font-weight: bold;">::</span> q a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> q a
  front      <span style="color: #ff6347; font-weight: bold;">::</span> q a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> a
  emptyQueue <span style="color: #ff6347; font-weight: bold;">::</span> q a
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org58cc4ac"></a>A naive implementation<br />
<div class="outline-text-5" id="text-2-5-2-1">
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">newtype</span> <span style="color: #8ae234; font-weight: bold;">Que</span> a <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>

<span style="color: #729fcf; font-weight: bold;">instance</span> <span style="color: #8ae234; font-weight: bold;">Queue</span> <span style="color: #8ae234; font-weight: bold;">Que</span> <span style="color: #729fcf; font-weight: bold;">where</span>
  enqueue x <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> q<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700;">(</span>q <span style="color: #ff6347; font-weight: bold;">++</span> <span style="color: #00bfff;">[</span>x<span style="color: #00bfff;">]</span><span style="color: #ffd700;">)</span>

  dequeue <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>     <span style="color: #ff6347; font-weight: bold;">=</span> error <span style="color: #ad7fa8; font-style: italic;">"Empty queue!"</span>
  dequeue <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">_</span><span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> xs

  front <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>    <span style="color: #ff6347; font-weight: bold;">=</span> error <span style="color: #ad7fa8; font-style: italic;">"Empty queue!"</span>
  front <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span><span style="color: #729fcf; font-weight: bold;">_</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> x

  emptyQueue <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
</pre>
</div>
<p>
<code>enqueue</code> takes <code>O(n)</code> steps.
</p>
</div>
</li>
