Note/FromRecursionToGreedy.org
***** Another implementation
#+BEGIN_SRC haskell

-- Another implementation by Burton
newtype Que a = Q ([a], [a])

instance Queue Que where
  enqueue x (Q ([], [])) = Q ([x], [])
  enqueue y (Q (xs, ys)) = Q (xs, y:ys)

  dequeue (Q ([], []))   = error "Empty queue!"
  dequeue (Q ([], ys))   = Q (tail (reverse ys), [])
  dequeue (Q (x:xs, ys)) = Q (xs, ys)

  front (Q ([], []))   = error "Empty queue!"
  front (Q ([], ys))   = last ys
  front (Q (x:xs, ys)) = x

  emptyQueue = Q ([], [])
#+END_SRC
- /Note/: Okasaki describes a method in which a list is reversed prograssively during dequeue
  operations so that the worest case for any dequeue operation is in =O(logn)=.

***** Priority queue
A priority queue is a queue in which each item has a priority associated with it.
The =dequeue= operation always removes the item with the highest(or lowest) priority.

****** A naive implementation
#+BEGIN_SRC haskell

newtype PQueue a = PQ [a]

instance Queue PQueue where
  emptyQueue = PQ []
  
  enqueue x (PQ q) = PQ (insert x q) where
    insert x [] = [x]
    insert x r@(e:r')
      | x <= e    = x:r
      | otherwise = e:insert x r'

  dequeue (PQ [])     = error "Empty queue!"
  dequeue (PQ (x:xs)) = PQ xs

  front (PQ [])     = error "Empty queue!"
  front (PQ (x:xs)) = x
#+END_SRC

****** Implementation with heap

**** TODO Heap
**** NEXT Set
#+BEGIN_SRC haskell

class Set s where
  emptySet :: S a
  inSet    :: (Eq a) => a -> s a -> Bool
  addSet   :: (Eq a) => a -> s a -> s a
  delSet   :: (Eq a) => a -> s a -> s a
#+END_SRC

***** List implementations

**** CANCELLED Vector
**** CANCELLED Table
**** NEXT More Trees [1/3]
