Note/FromRecursionToGreedy.html

<li><a id="org3364422"></a>Another implementation<br />
<div class="outline-text-5" id="text-2-5-2-2">
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #888a85; font-style: italic;">-- </span><span style="color: #888a85; font-style: italic;">Another implementation by Burton</span>
<span style="color: #729fcf; font-weight: bold;">newtype</span> <span style="color: #8ae234; font-weight: bold;">Que</span> a <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700;">(</span><span style="color: #00bfff;">[</span>a<span style="color: #00bfff;">]</span>, <span style="color: #00bfff;">[</span>a<span style="color: #00bfff;">]</span><span style="color: #ffd700;">)</span>

<span style="color: #729fcf; font-weight: bold;">instance</span> <span style="color: #8ae234; font-weight: bold;">Queue</span> <span style="color: #8ae234; font-weight: bold;">Que</span> <span style="color: #729fcf; font-weight: bold;">where</span>
  enqueue x <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span><span style="color: #ffa500; font-weight: bold;">[]</span>, <span style="color: #ffa500; font-weight: bold;">[]</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700;">(</span><span style="color: #00bfff;">[</span>x<span style="color: #00bfff;">]</span>, <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>
  enqueue y <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span>xs, ys<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700;">(</span>xs, y<span style="color: #8ae234; font-weight: bold;">:</span>ys<span style="color: #ffd700;">)</span>

  dequeue <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span><span style="color: #ffa500; font-weight: bold;">[]</span>, <span style="color: #ffa500; font-weight: bold;">[]</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>   <span style="color: #ff6347; font-weight: bold;">=</span> error <span style="color: #ad7fa8; font-style: italic;">"Empty queue!"</span>
  dequeue <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span><span style="color: #ffa500; font-weight: bold;">[]</span>, ys<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>   <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700;">(</span>tail <span style="color: #00bfff;">(</span>reverse ys<span style="color: #00bfff;">)</span>, <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>
  dequeue <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs, ys<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700;">(</span>xs, ys<span style="color: #ffd700;">)</span>

  front <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span><span style="color: #ffa500; font-weight: bold;">[]</span>, <span style="color: #ffa500; font-weight: bold;">[]</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>   <span style="color: #ff6347; font-weight: bold;">=</span> error <span style="color: #ad7fa8; font-style: italic;">"Empty queue!"</span>
  front <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span><span style="color: #ffa500; font-weight: bold;">[]</span>, ys<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>   <span style="color: #ff6347; font-weight: bold;">=</span> last ys
  front <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #00bfff;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs, ys<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> x

  emptyQueue <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Q</span> <span style="color: #ffd700;">(</span><span style="color: #00bfff; font-weight: bold;">[]</span>, <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>
</pre>
</div>
<ul class="org-ul">
<li><i>Note</i>: Okasaki describes a method in which a list is reversed prograssively during dequeue
operations so that the worest case for any dequeue operation is in <code>O(logn)</code>.</li>
</ul>
</div>
</li>

<li><a id="org51e8207"></a>Priority queue<br />
<div class="outline-text-5" id="text-2-5-2-3">
<p>
A priority queue is a queue in which each item has a priority associated with it.
The <code>dequeue</code> operation always removes the item with the highest(or lowest) priority.
</p>
</div>

<ol class="org-ol">
<li><a id="org9619981"></a>A naive implementation<br />
<div class="outline-text-6" id="text-2-5-2-3-1">
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">newtype</span> <span style="color: #8ae234; font-weight: bold;">PQueue</span> a <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">PQ</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>

<span style="color: #729fcf; font-weight: bold;">instance</span> <span style="color: #8ae234; font-weight: bold;">Queue</span> <span style="color: #8ae234; font-weight: bold;">PQueue</span> <span style="color: #729fcf; font-weight: bold;">where</span>
  emptyQueue <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">PQ</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
  
  enqueue x <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">PQ</span> q<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">PQ</span> <span style="color: #ffd700;">(</span>insert x q<span style="color: #ffd700;">)</span> <span style="color: #729fcf; font-weight: bold;">where</span>
    insert x <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">[</span>x<span style="color: #ffd700;">]</span>
    insert x r<span style="color: #ff6347; font-weight: bold;">@</span><span style="color: #ffd700;">(</span>e<span style="color: #8ae234; font-weight: bold;">:</span>r'<span style="color: #ffd700;">)</span>
      <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&lt;=</span> e    <span style="color: #ff6347; font-weight: bold;">=</span> x<span style="color: #8ae234; font-weight: bold;">:</span>r
      <span style="color: #ff6347; font-weight: bold;">|</span> otherwise <span style="color: #ff6347; font-weight: bold;">=</span> e<span style="color: #8ae234; font-weight: bold;">:</span>insert x r'

  dequeue <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">PQ</span> <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>     <span style="color: #ff6347; font-weight: bold;">=</span> error <span style="color: #ad7fa8; font-style: italic;">"Empty queue!"</span>
  dequeue <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">PQ</span> <span style="color: #00bfff;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">PQ</span> xs

  front <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">PQ</span> <span style="color: #00bfff; font-weight: bold;">[]</span><span style="color: #ffd700;">)</span>     <span style="color: #ff6347; font-weight: bold;">=</span> error <span style="color: #ad7fa8; font-style: italic;">"Empty queue!"</span>
  front <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">PQ</span> <span style="color: #00bfff;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> x
</pre>
</div>
</div>
</li>

<li><a id="org994da63"></a>Implementation with heap<br /></li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-orgc173af8" class="outline-4">
<h4 id="orgc173af8"><span class="section-number-4">2.5.3</span> <span class="todo TODO">TODO</span> Heap</h4>
<div class="outline-text-4" id="text-2-5-3">
<ul class="org-ul">
<li>Definition</li>
</ul>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">class</span> <span style="color: #8ae234; font-weight: bold;">Heap</span> h <span style="color: #729fcf; font-weight: bold;">where</span>
  emptyHeap <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> h a
  insHeap   <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> h a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> h a
  delHeap   <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> h a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> h a
</pre>
</div>
</div>
</div>



<div id="outline-container-orgc47e7a4" class="outline-4">
<h4 id="orgc47e7a4"><span class="section-number-4">2.5.4</span> <span class="todo NEXT">NEXT</span> Set</h4>
<div class="outline-text-4" id="text-2-5-4">
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">class</span> <span style="color: #8ae234; font-weight: bold;">Set</span> s <span style="color: #729fcf; font-weight: bold;">where</span>
  emptySet <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">S</span> a
  inSet    <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Eq</span> a<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=&gt;</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> s a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #8ae234; font-weight: bold;">Bool</span>
  addSet   <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Eq</span> a<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=&gt;</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> s a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> s a
  delSet   <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Eq</span> a<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=&gt;</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> s a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> s a
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org27c892a"></a>List implementations<br /></li>
</ol>
</div>

<div id="outline-container-org9c5029f" class="outline-4">
<h4 id="org9c5029f"><span class="section-number-4">2.5.5</span> <span class="done CANCELLED">CANCELLED</span> Vector</h4>
</div>
<div id="outline-container-org53a7351" class="outline-4">
<h4 id="org53a7351"><span class="section-number-4">2.5.6</span> <span class="done CANCELLED">CANCELLED</span> Table</h4>
</div>
<div id="outline-container-org947ea09" class="outline-4">
<h4 id="org947ea09"><span class="section-number-4">2.5.7</span> <span class="todo NEXT">NEXT</span> More Trees <code>[1/3]</code></h4>
<div class="outline-text-4" id="text-2-5-7">
</div>
<ol class="org-ol">
