Note/FromRecursionToGreedy.org
***** DONE Binary Search Tree
- Definition
#+BEGIN_SRC haskell

{-# LANGUAGE GADTs #-}
data BinTree a where
  None :: Ord a => BinTree a
  Node :: Ord a => a -> BinTree a -> BinTree a -> BinTree a
#+END_SRC

- Finding elements

Very straight-forward =O(logn)=.
#+BEGIN_SRC haskell

inTree x None = False
inTree x (Node v lf rt)
  | x == v = True
  | x <  v = inTree x lf
  | x >  v = inTree x rt
#+END_SRC


- Adding items

Very straight-forward =O(logn)=.
#+BEGIN_SRC haskell

addTree x None = Node x None None
addTree x t@(Node v lf rt)
  | x == v = t
  | x <  v = Node v (addTree x lf) rt
  | x >  v = Node v lf (addTree x rt)
#+END_SRC


- Building

#+BEGIN_SRC haskell

-- A naive building function
buildTree lf = foldr addTree None lf
#+END_SRC
However, this implementation may produce unbalanced tree.
It's possible to build a tree with a minimum depth:

#+BEGIN_SRC haskell

buildTree' []  = None
buildTree' lf  = Node x (buildTree' l1) (buildTree' l2)
  where l1     = take n lf
        (x:l2) = drop n lf
        n      = (length lf) `div` 2
#+END_SRC

- Removing an item
#+BEGIN_SRC haskell

delTree x None = None
delTree x (Node v lf None)
  | x == v = lf
delTree x (Node v None rt)
  | x == v = rt
delTree x (Node x lf rt)
  | x <  v = Node v (delTree x lf) rt
  | x >  v = Node v lf (delTree x rt)
  | x == v = Node k lf (delTree k rt) where 
    k = minTree rt
    minTree (Node v None _) = v
    minTree (Node _ left _) = minTree left
#+END_SRC

***** TODO AVL Tree
***** TODO Red-black Tree

** Dynamic Programming
Dynamic programming is about finding similar sub structures.

