Note/FromRecursionToGreedy.html
<li><a id="orga2e1763"></a><span class="done DONE">DONE</span> Binary Search Tree<br />
<div class="outline-text-5" id="text-2-5-7-1">
<ul class="org-ul">
<li>Definition</li>
</ul>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf;">{-# LANGUAGE GADTs #-}</span>
<span style="color: #729fcf; font-weight: bold;">data</span> <span style="color: #8ae234; font-weight: bold;">BinTree</span> a <span style="color: #729fcf; font-weight: bold;">where</span>
  <span style="color: #8ae234; font-weight: bold;">None</span> <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> <span style="color: #8ae234; font-weight: bold;">BinTree</span> a
  <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #8ae234; font-weight: bold;">BinTree</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #8ae234; font-weight: bold;">BinTree</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #8ae234; font-weight: bold;">BinTree</span> a
</pre>
</div>

<ul class="org-ul">
<li>Finding elements</li>
</ul>

<p>
Very straight-forward <code>O(logn)</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">inTree</span> x <span style="color: #8ae234; font-weight: bold;">None</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">False</span>
<span style="color: #edd400; font-weight: bold;">inTree</span> x <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v lf rt<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">==</span> v <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">True</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&lt;</span>  v <span style="color: #ff6347; font-weight: bold;">=</span> inTree x lf
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&gt;</span>  v <span style="color: #ff6347; font-weight: bold;">=</span> inTree x rt
</pre>
</div>


<ul class="org-ul">
<li>Adding items</li>
</ul>

<p>
Very straight-forward <code>O(logn)</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">addTree</span> x <span style="color: #8ae234; font-weight: bold;">None</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> x <span style="color: #8ae234; font-weight: bold;">None</span> <span style="color: #8ae234; font-weight: bold;">None</span>
<span style="color: #edd400; font-weight: bold;">addTree</span> x t<span style="color: #ff6347; font-weight: bold;">@</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v lf rt<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">==</span> v <span style="color: #ff6347; font-weight: bold;">=</span> t
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&lt;</span>  v <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> v <span style="color: #ffd700;">(</span>addTree x lf<span style="color: #ffd700;">)</span> rt
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&gt;</span>  v <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> v lf <span style="color: #ffd700;">(</span>addTree x rt<span style="color: #ffd700;">)</span>
</pre>
</div>


<ul class="org-ul">
<li>Building</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #888a85; font-style: italic;">-- </span><span style="color: #888a85; font-style: italic;">A naive building function</span>
<span style="color: #edd400; font-weight: bold;">buildTree</span> lf <span style="color: #ff6347; font-weight: bold;">=</span> foldr addTree <span style="color: #8ae234; font-weight: bold;">None</span> lf
</pre>
</div>
<p>
However, this implementation may produce unbalanced tree.
It's possible to build a tree with a minimum depth:
</p>

<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">buildTree'</span> <span style="color: #ffd700; font-weight: bold;">[]</span>  <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">None</span>
<span style="color: #edd400; font-weight: bold;">buildTree'</span> lf  <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> x <span style="color: #ffd700;">(</span>buildTree' l1<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>buildTree' l2<span style="color: #ffd700;">)</span>
  <span style="color: #729fcf; font-weight: bold;">where</span> l1     <span style="color: #ff6347; font-weight: bold;">=</span> take n lf
        <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>l2<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> drop n lf
        n      <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">(</span>length lf<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">`div`</span> 2
</pre>
</div>

<ul class="org-ul">
<li>Removing an item</li>
</ul>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">delTree</span> x <span style="color: #8ae234; font-weight: bold;">None</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">None</span>
<span style="color: #edd400; font-weight: bold;">delTree</span> x <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v lf <span style="color: #8ae234; font-weight: bold;">None</span><span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">==</span> v <span style="color: #ff6347; font-weight: bold;">=</span> lf
<span style="color: #edd400; font-weight: bold;">delTree</span> x <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v <span style="color: #8ae234; font-weight: bold;">None</span> rt<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">==</span> v <span style="color: #ff6347; font-weight: bold;">=</span> rt
<span style="color: #edd400; font-weight: bold;">delTree</span> x <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> x lf rt<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&lt;</span>  v <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> v <span style="color: #ffd700;">(</span>delTree x lf<span style="color: #ffd700;">)</span> rt
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&gt;</span>  v <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> v lf <span style="color: #ffd700;">(</span>delTree x rt<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">==</span> v <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> k lf <span style="color: #ffd700;">(</span>delTree k rt<span style="color: #ffd700;">)</span> <span style="color: #729fcf; font-weight: bold;">where</span> 
    k <span style="color: #ff6347; font-weight: bold;">=</span> minTree rt
    minTree <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> v <span style="color: #8ae234; font-weight: bold;">None</span> <span style="color: #729fcf; font-weight: bold;">_</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> v
    minTree <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #729fcf; font-weight: bold;">_</span> left <span style="color: #729fcf; font-weight: bold;">_</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> minTree left
</pre>
</div>
</div>
</li>

<li><a id="org6083cb2"></a><span class="todo TODO">TODO</span> AVL Tree<br /></li>
<li><a id="orge95b6ed"></a><span class="todo TODO">TODO</span> Red-black Tree<br /></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org50c75b9" class="outline-2">
<h2 id="org50c75b9"><span class="section-number-2">3</span> Dynamic Programming</h2>
<div class="outline-text-2" id="text-3">
<p>
Dynamic programming is about finding similar sub structures.
</p>
</div>
