Note/FromRecursionToGreedy.html

<div id="outline-container-orgbe17b49" class="outline-3">
<h3 id="orgbe17b49"><span class="section-number-3">3.1</span> A dynamic programming example by expanding data structure</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Suppose we want to insert a node at the lowest level of the smallest sub-tree.
(Binary Tree definition just as before)
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">tinsert</span> v <span style="color: #8ae234; font-weight: bold;">Empty</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> v <span style="color: #8ae234; font-weight: bold;">Empty</span> <span style="color: #8ae234; font-weight: bold;">Empty</span>
<span style="color: #edd400; font-weight: bold;">tinsert</span> v <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Node</span> w t0 t1<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> size t0 <span style="color: #ff6347; font-weight: bold;">&lt;=</span> size t1 <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> w <span style="color: #ffd700;">(</span>tinsert v t0<span style="color: #ffd700;">)</span> t1
  <span style="color: #ff6347; font-weight: bold;">|</span> otherwise          <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Node</span> w t0 <span style="color: #ffd700;">(</span>tinsert v t1<span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
We can see that the function <code>size</code> is used several times and it seems that there're
relations between levels of sub-trees that can be used to calculate the size more efficiently.
</p>

<p>
An alternative is to use the following tree definition instead:
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">data</span> <span style="color: #8ae234; font-weight: bold;">BinTreeM</span> a 
  <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">EmptyM</span> 
  <span style="color: #ff6347; font-weight: bold;">|</span> <span style="color: #8ae234; font-weight: bold;">NodeM</span> <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">Int</span>, <span style="color: #8ae234; font-weight: bold;">Int</span><span style="color: #ffd700;">)</span> a <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">BinTreeM</span> a<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">BinTreeM</span> a<span style="color: #ffd700;">)</span>

<span style="color: #edd400; font-weight: bold;">tinsertM</span> v <span style="color: #8ae234; font-weight: bold;">EmptyM</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">NodeM</span> <span style="color: #ffd700;">(</span>0, 0<span style="color: #ffd700;">)</span> v <span style="color: #8ae234; font-weight: bold;">EmptyM</span> <span style="color: #8ae234; font-weight: bold;">EmptyM</span>
<span style="color: #edd400; font-weight: bold;">tinsertM</span> v <span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">NodeM</span> <span style="color: #00bfff;">(</span>s0, s1<span style="color: #00bfff;">)</span> w t0 t1<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> s0 <span style="color: #ff6347; font-weight: bold;">&lt;=</span> s1  <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">NodeM</span> <span style="color: #ffd700;">(</span>s0 <span style="color: #ff6347; font-weight: bold;">+</span> 1, s1<span style="color: #ffd700;">)</span> w <span style="color: #ffd700;">(</span>tinsertM v t0<span style="color: #ffd700;">)</span> t1
  <span style="color: #ff6347; font-weight: bold;">|</span> otherwise <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">NodeM</span> <span style="color: #ffd700;">(</span>s0, s1 <span style="color: #ff6347; font-weight: bold;">+</span> 1<span style="color: #ffd700;">)</span> w t0 <span style="color: #ffd700;">(</span>tinsertM v t1<span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
However, you may think that this example is not a right dynamic programming example.
So let's take more examples.
</p>
</div>
</div>

<div id="outline-container-org39fd440" class="outline-3">
<h3 id="org39fd440"><span class="section-number-3">3.2</span> A dynamic programming example by using extra data structure</h3>
<div class="outline-text-3" id="text-3-2">
<p>
A well-known data structre used frequently in dynamic programming is <code>Array</code>.
</p>
</div>
</div>
</div>


<div id="outline-container-orgfa5a815" class="outline-2">
<h2 id="orgfa5a815"><span class="section-number-2">4</span> Greedy</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-01-22 周三 00:00</p>
<p class="author">Author: Comcx</p>
<p class="date">Created: 2020-01-26 周日 19:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
